; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	thermograph0 - mode
	infrared1 - mode
	thermograph2 - mode
	Star2 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Planet4 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Star18 - direction
	Planet19 - direction
	Phenomenon20 - direction
	Phenomenon21 - direction
	Planet22 - direction
	Planet23 - direction
	Phenomenon24 - direction
	Phenomenon25 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon7)
	(supports instrument5 thermograph0)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon24)
	(supports instrument6 thermograph2)
	(supports instrument6 thermograph0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 thermograph2)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 thermograph2)
	(supports instrument8 infrared1)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon21)
)
(:goal (and
	(pointing satellite0 Star18)
	(pointing satellite1 Star13)
	(pointing satellite3 GroundStation1)
	(have_image Planet4 thermograph2)
	(have_image Planet5 thermograph2)
	(have_image Phenomenon7 thermograph2)
	(have_image Star8 thermograph2)
	(have_image Phenomenon9 thermograph2)
	(have_image Star10 thermograph0)
	(have_image Planet11 thermograph0)
	(have_image Star13 thermograph0)
	(have_image Star14 thermograph2)
	(have_image Star15 thermograph0)
	(have_image Phenomenon16 infrared1)
	(have_image Star17 thermograph0)
	(have_image Star18 thermograph2)
	(have_image Planet19 thermograph0)
	(have_image Phenomenon20 thermograph0)
	(have_image Planet23 thermograph2)
	(have_image Phenomenon24 infrared1)
	(have_image Phenomenon25 thermograph0)
))

)

; plan
1. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 21
2. (turn_to satellite4 groundstation0 phenomenon21)
   deleted: (pointing satellite4 phenomenon21)
   added: (pointing satellite4 groundstation0)
   goals met: 0 of 21
3. (calibrate satellite4 instrument6 groundstation0)
   added: (calibrated instrument6)
   goals met: 0 of 21
4. (turn_to satellite4 phenomenon16 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon16)
   goals met: 0 of 21
5. (take_image satellite4 phenomenon16 instrument6 infrared1)
   added: (have_image phenomenon16 infrared1)
   goals met: 1 of 21
6. (turn_to satellite4 phenomenon20 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 phenomenon20)
   goals met: 1 of 21
7. (take_image satellite4 phenomenon20 instrument6 thermograph0)
   added: (have_image phenomenon20 thermograph0)
   goals met: 2 of 21
8. (turn_to satellite4 phenomenon24 phenomenon20)
   deleted: (pointing satellite4 phenomenon20)
   added: (pointing satellite4 phenomenon24)
   goals met: 2 of 21
9. (take_image satellite4 phenomenon24 instrument6 infrared1)
   added: (have_image phenomenon24 infrared1)
   goals met: 3 of 21
10. (turn_to satellite4 phenomenon25 phenomenon24)
   deleted: (pointing satellite4 phenomenon24)
   added: (pointing satellite4 phenomenon25)
   goals met: 3 of 21
11. (take_image satellite4 phenomenon25 instrument6 thermograph0)
   added: (have_image phenomenon25 thermograph0)
   goals met: 4 of 21
12. (turn_to satellite4 phenomenon7 phenomenon25)
   deleted: (pointing satellite4 phenomenon25)
   added: (pointing satellite4 phenomenon7)
   goals met: 4 of 21
13. (take_image satellite4 phenomenon7 instrument6 thermograph2)
   added: (have_image phenomenon7 thermograph2)
   goals met: 5 of 21
14. (turn_to satellite4 phenomenon9 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 phenomenon9)
   goals met: 5 of 21
15. (take_image satellite4 phenomenon9 instrument6 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 6 of 21
16. (turn_to satellite4 planet11 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet11)
   goals met: 6 of 21
17. (take_image satellite4 planet11 instrument6 thermograph0)
   added: (have_image planet11 thermograph0)
   goals met: 7 of 21
18. (turn_to satellite4 planet19 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet19)
   goals met: 7 of 21
19. (take_image satellite4 planet19 instrument6 thermograph0)
   added: (have_image planet19 thermograph0)
   goals met: 8 of 21
20. (turn_to satellite4 planet23 planet19)
   deleted: (pointing satellite4 planet19)
   added: (pointing satellite4 planet23)
   goals met: 8 of 21
21. (take_image satellite4 planet23 instrument6 thermograph2)
   added: (have_image planet23 thermograph2)
   goals met: 9 of 21
22. (turn_to satellite4 planet4 planet23)
   deleted: (pointing satellite4 planet23)
   added: (pointing satellite4 planet4)
   goals met: 9 of 21
23. (take_image satellite4 planet4 instrument6 thermograph2)
   added: (have_image planet4 thermograph2)
   goals met: 10 of 21
24. (turn_to satellite4 planet5 planet4)
   deleted: (pointing satellite4 planet4)
   added: (pointing satellite4 planet5)
   goals met: 10 of 21
25. (take_image satellite4 planet5 instrument6 thermograph2)
   added: (have_image planet5 thermograph2)
   goals met: 11 of 21
26. (turn_to satellite4 star10 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 star10)
   goals met: 11 of 21
27. (take_image satellite4 star10 instrument6 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 12 of 21
28. (turn_to satellite4 star13 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 star13)
   goals met: 12 of 21
29. (take_image satellite4 star13 instrument6 thermograph0)
   added: (have_image star13 thermograph0)
   goals met: 13 of 21
30. (turn_to satellite4 star14 star13)
   deleted: (pointing satellite4 star13)
   added: (pointing satellite4 star14)
   goals met: 13 of 21
31. (take_image satellite4 star14 instrument6 thermograph2)
   added: (have_image star14 thermograph2)
   goals met: 14 of 21
32. (turn_to satellite4 star15 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 star15)
   goals met: 14 of 21
33. (take_image satellite4 star15 instrument6 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 15 of 21
34. (turn_to satellite4 star17 star15)
   deleted: (pointing satellite4 star15)
   added: (pointing satellite4 star17)
   goals met: 15 of 21
35. (take_image satellite4 star17 instrument6 thermograph0)
   added: (have_image star17 thermograph0)
   goals met: 16 of 21
36. (turn_to satellite4 star18 star17)
   deleted: (pointing satellite4 star17)
   added: (pointing satellite4 star18)
   goals met: 16 of 21
37. (take_image satellite4 star18 instrument6 thermograph2)
   added: (have_image star18 thermograph2)
   goals met: 17 of 21
38. (turn_to satellite4 star8 star18)
   deleted: (pointing satellite4 star18)
   added: (pointing satellite4 star8)
   goals met: 17 of 21
39. (take_image satellite4 star8 instrument6 thermograph2)
   added: (have_image star8 thermograph2)
   goals met: 18 of 21
40. (turn_to satellite3 groundstation1 phenomenon24)
   deleted: (pointing satellite3 phenomenon24)
   added: (pointing satellite3 groundstation1)
   goals met: 19 of 21
41. (turn_to satellite1 star13 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star13)
   goals met: 20 of 21
42. (turn_to satellite0 star18 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star18)
   goals met: 21 of 21
